# Задание 1
a= 5
b= 6
c= 7
print ((a+b+c)/3)

#Задание 2
name = "Nazgul"
city = "Temirtau"
print ("Привет, меня зовут", name, "Я живу в городе ", city)

#Задание 3
r= 25
pi=3.14
C=2*pi
S=pi*r*r
print ("Длина окружности  = ", C ,"Площадь окружности = ", S)

#Задание 4
is_sunny=True
temperature =25
print ("На улице солнечно? ", is_sunny, " А температура? ", temperature)